sysbench/oltp_update_index_flexible.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 1548.97 qps: 1548.97 (r/w/o: 0.00/1548.97/0.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 1592.33 qps: 1592.33 (r/w/o: 0.00/1592.33/0.00) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 1567.25 qps: 1567.25 (r/w/o: 0.00/1567.25/0.00) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 1571.84 qps: 1571.84 (r/w/o: 0.00/1571.84/0.00) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 1638.23 qps: 1638.23 (r/w/o: 0.00/1638.23/0.00) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 1594.14 qps: 1594.14 (r/w/o: 0.00/1594.14/0.00) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 1602.52 qps: 1602.52 (r/w/o: 0.00/1602.52/0.00) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 1514.01 qps: 1514.01 (r/w/o: 0.00/1514.01/0.00) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 1637.07 qps: 1637.07 (r/w/o: 0.00/1637.07/0.00) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 1597.19 qps: 1597.19 (r/w/o: 0.00/1597.19/0.00) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      10.274 |                                         3
      10.651 |                                         6
      10.844 |                                         7
      11.041 |                                         7
      11.242 |                                         13
      11.446 |                                         17
      11.654 |                                         22
      11.866 |                                         31
      12.081 |                                         51
      12.301 |                                         89
      12.524 |                                         81
      12.752 |*                                        118
      12.984 |*                                        141
      13.219 |*                                        230
      13.460 |**                                       322
      13.704 |**                                       429
      13.953 |***                                      511
      14.207 |***                                      667
      14.465 |****                                     857
      14.728 |******                                   1188
      14.995 |*******                                  1482
      15.268 |*********                                1836
      15.545 |***********                              2317
      15.828 |**************                           2886
      16.115 |******************                       3650
      16.408 |**********************                   4456
      16.706 |*************************                5164
      17.010 |*****************************            5973
      17.319 |********************************         6585
      17.633 |*************************************    7575
      17.954 |***************************************  7926
      18.280 |**************************************** 8114
      18.612 |***************************************  7848
      18.950 |**************************************   7704
      19.295 |*************************************    7426
      19.645 |**********************************       6958
      20.002 |********************************         6561
      20.366 |*******************************          6277
      20.736 |****************************             5657
      21.112 |**************************               5184
      21.496 |***********************                  4742
      21.886 |*********************                    4230
      22.284 |******************                       3661
      22.689 |****************                         3284
      23.101 |**************                           2939
      23.521 |**************                           2771
      23.948 |************                             2435
      24.384 |***********                              2145
      24.827 |*********                                1781
      25.278 |*******                                  1476
      25.737 |*******                                  1478
      26.205 |******                                   1278
      26.681 |******                                   1171
      27.165 |*****                                    1070
      27.659 |****                                     873
      28.162 |****                                     783
      28.673 |****                                     807
      29.194 |***                                      697
      29.725 |***                                      616
      30.265 |***                                      511
      30.815 |***                                      513
      31.375 |**                                       420
      31.945 |**                                       333
      32.525 |**                                       309
      33.116 |**                                       354
      33.718 |*                                        263
      34.330 |*                                        201
      34.954 |*                                        185
      35.589 |*                                        132
      36.236 |*                                        110
      36.894 |                                         79
      37.565 |                                         93
      38.247 |                                         47
      38.942 |                                         74
      39.650 |                                         39
      40.370 |                                         65
      41.104 |                                         62
      41.851 |                                         43
      42.611 |                                         28
      43.385 |                                         26
      44.173 |                                         22
      44.976 |                                         7
      45.793 |                                         13
      46.625 |                                         22
      47.472 |                                         10
      48.335 |                                         7
      49.213 |                                         10
      50.107 |                                         1
      51.018 |                                         3
      51.945 |                                         4
      52.889 |                                         1
      53.850 |                                         1
      54.828 |                                         1
      55.824 |                                         1
      56.839 |                                         3
      57.871 |                                         1
      58.923 |                                         1
      61.083 |                                         2
      62.193 |                                         3
      64.474 |                                         2
      66.838 |                                         1
      68.053 |                                         2
      70.548 |                                         1
      77.194 |                                         2
     150.290 |                                         3
     153.021 |                                         1
     155.801 |                                         3
     158.632 |                                         1
     161.514 |                                         2
     164.449 |                                         3
     167.437 |                                         1
     173.577 |                                         1
     176.731 |                                         7
     179.942 |                                         3
     186.540 |                                         3
     189.929 |                                         4
     193.380 |                                         2
     200.472 |                                         1
     204.114 |                                         1
     207.823 |                                         1
     211.599 |                                         2
     215.443 |                                         1
     219.358 |                                         3
     227.402 |                                         1
     231.534 |                                         1
    3040.139 |                                         1
    3095.377 |                                         6
    3151.619 |                                         1
 
SQL statistics:
    queries performed:
        read:                            0
        write:                           158667
        other:                           0
        total:                           158667
    transactions:                        158667 (1586.24 per sec.)
    queries:                             158667 (1586.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0256s
    total number of events:              158667

Latency (ms):
         min:                                   10.28
         avg:                                   20.16
         max:                                 3124.58
         99th percentile:                       33.72
         sum:                              3199151.62

Threads fairness:
    events (avg/stddev):           4958.3438/90.30
    execution time (avg/stddev):   99.9735/0.01